name: "sam"
platform: "pytorch_libtorch"
max_batch_size: 1
input [
  {
    name: "input_image"
    data_type: TYPE_FP32
    dims: [ 3, 1024, 1024 ]
  }
]
output [
  {
    name: "masks"
    data_type: TYPE_FP32
    dims: [ 1, 256, 256 ]
  }
]
